aiandrobotics/fabrica/firmware/sdkconfig.defaults
# Target Device Configuration
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y

# CPU Clock Frequency: 240 MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# FreeRTOS Configuration: 1000 Hz tick rate (1ms tick)
CONFIG_FREERTOS_HZ=1000

# Flash Memory Configuration: 4 MB, DIO mode, 40MHz
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

# Console UART Configuration (115200 bps)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Compiler Options
CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y
